7767517
306 355
Input                    in0                      0 1 in0
BinaryOp                 sub_0                    1 1 in0 1 0=1 1=1 2=127.5
BinaryOp                 mul_1                    1 1 1 2 0=2 1=1 2=0.0078125
Convolution              conv_50                  1 1 2 3 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728
PReLU                    prelu_154                1 1 3 4 0=64
Split                    splitncnn_0              1 2 4 5 6
BatchNorm                bn_0                     1 1 5 7 0=64 1=2.000000e-05
Convolution              conv_51                  1 1 7 8 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
PReLU                    prelu_155                1 1 8 9 0=64
Convolution              conv_52                  1 1 9 10 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Convolution              conv_53                  1 1 6 11 0=64 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=4096
BinaryOp                 add_2                    2 1 10 11 12 0=0
Split                    splitncnn_1              1 2 12 13 14
BatchNorm                bn_1                     1 1 14 15 0=64 1=2.000000e-05
Convolution              conv_54                  1 1 15 16 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
PReLU                    prelu_156                1 1 16 17 0=64
Convolution              conv_55                  1 1 17 18 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_3                    2 1 18 13 19 0=0
Split                    splitncnn_2              1 2 19 20 21
BatchNorm                bn_2                     1 1 21 22 0=64 1=2.000000e-05
Convolution              conv_56                  1 1 22 23 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
PReLU                    prelu_157                1 1 23 24 0=64
Convolution              conv_57                  1 1 24 25 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_4                    2 1 25 20 26 0=0
Split                    splitncnn_3              1 2 26 27 28
BatchNorm                bn_3                     1 1 27 29 0=64 1=2.000000e-05
Convolution              conv_58                  1 1 29 30 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
PReLU                    prelu_158                1 1 30 31 0=128
Convolution              conv_59                  1 1 31 32 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_60                  1 1 28 33 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=8192
BinaryOp                 add_5                    2 1 32 33 34 0=0
Split                    splitncnn_4              1 2 34 35 36
BatchNorm                bn_4                     1 1 36 37 0=128 1=2.000000e-05
Convolution              conv_61                  1 1 37 38 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_159                1 1 38 39 0=128
Convolution              conv_62                  1 1 39 40 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_6                    2 1 40 35 41 0=0
Split                    splitncnn_5              1 2 41 42 43
BatchNorm                bn_5                     1 1 43 44 0=128 1=2.000000e-05
Convolution              conv_63                  1 1 44 45 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_160                1 1 45 46 0=128
Convolution              conv_64                  1 1 46 47 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_7                    2 1 47 42 48 0=0
Split                    splitncnn_6              1 2 48 49 50
BatchNorm                bn_6                     1 1 50 51 0=128 1=2.000000e-05
Convolution              conv_65                  1 1 51 52 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_161                1 1 52 53 0=128
Convolution              conv_66                  1 1 53 54 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_8                    2 1 54 49 55 0=0
Split                    splitncnn_7              1 2 55 56 57
BatchNorm                bn_7                     1 1 57 58 0=128 1=2.000000e-05
Convolution              conv_67                  1 1 58 59 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_162                1 1 59 60 0=128
Convolution              conv_68                  1 1 60 61 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_9                    2 1 61 56 62 0=0
Split                    splitncnn_8              1 2 62 63 64
BatchNorm                bn_8                     1 1 64 65 0=128 1=2.000000e-05
Convolution              conv_69                  1 1 65 66 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_163                1 1 66 67 0=128
Convolution              conv_70                  1 1 67 68 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_10                   2 1 68 63 69 0=0
Split                    splitncnn_9              1 2 69 70 71
BatchNorm                bn_9                     1 1 71 72 0=128 1=2.000000e-05
Convolution              conv_71                  1 1 72 73 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_164                1 1 73 74 0=128
Convolution              conv_72                  1 1 74 75 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_11                   2 1 75 70 76 0=0
Split                    splitncnn_10             1 2 76 77 78
BatchNorm                bn_10                    1 1 78 79 0=128 1=2.000000e-05
Convolution              conv_73                  1 1 79 80 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_165                1 1 80 81 0=128
Convolution              conv_74                  1 1 81 82 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_12                   2 1 82 77 83 0=0
Split                    splitncnn_11             1 2 83 84 85
BatchNorm                bn_11                    1 1 85 86 0=128 1=2.000000e-05
Convolution              conv_75                  1 1 86 87 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_166                1 1 87 88 0=128
Convolution              conv_76                  1 1 88 89 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_13                   2 1 89 84 90 0=0
Split                    splitncnn_12             1 2 90 91 92
BatchNorm                bn_12                    1 1 92 93 0=128 1=2.000000e-05
Convolution              conv_77                  1 1 93 94 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_167                1 1 94 95 0=128
Convolution              conv_78                  1 1 95 96 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_14                   2 1 96 91 97 0=0
Split                    splitncnn_13             1 2 97 98 99
BatchNorm                bn_13                    1 1 99 100 0=128 1=2.000000e-05
Convolution              conv_79                  1 1 100 101 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_168                1 1 101 102 0=128
Convolution              conv_80                  1 1 102 103 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_15                   2 1 103 98 104 0=0
Split                    splitncnn_14             1 2 104 105 106
BatchNorm                bn_14                    1 1 106 107 0=128 1=2.000000e-05
Convolution              conv_81                  1 1 107 108 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_169                1 1 108 109 0=128
Convolution              conv_82                  1 1 109 110 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_16                   2 1 110 105 111 0=0
Split                    splitncnn_15             1 2 111 112 113
BatchNorm                bn_15                    1 1 113 114 0=128 1=2.000000e-05
Convolution              conv_83                  1 1 114 115 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
PReLU                    prelu_170                1 1 115 116 0=128
Convolution              conv_84                  1 1 116 117 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_17                   2 1 117 112 118 0=0
Split                    splitncnn_16             1 2 118 119 120
BatchNorm                bn_16                    1 1 119 121 0=128 1=2.000000e-05
Convolution              conv_85                  1 1 121 122 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
PReLU                    prelu_171                1 1 122 123 0=256
Convolution              conv_86                  1 1 123 124 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Convolution              conv_87                  1 1 120 125 0=256 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=32768
BinaryOp                 add_18                   2 1 124 125 126 0=0
Split                    splitncnn_17             1 2 126 127 128
BatchNorm                bn_17                    1 1 128 129 0=256 1=2.000000e-05
Convolution              conv_88                  1 1 129 130 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_172                1 1 130 131 0=256
Convolution              conv_89                  1 1 131 132 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_19                   2 1 132 127 133 0=0
Split                    splitncnn_18             1 2 133 134 135
BatchNorm                bn_18                    1 1 135 136 0=256 1=2.000000e-05
Convolution              conv_90                  1 1 136 137 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_173                1 1 137 138 0=256
Convolution              conv_91                  1 1 138 139 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_20                   2 1 139 134 140 0=0
Split                    splitncnn_19             1 2 140 141 142
BatchNorm                bn_19                    1 1 142 143 0=256 1=2.000000e-05
Convolution              conv_92                  1 1 143 144 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_174                1 1 144 145 0=256
Convolution              conv_93                  1 1 145 146 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_21                   2 1 146 141 147 0=0
Split                    splitncnn_20             1 2 147 148 149
BatchNorm                bn_20                    1 1 149 150 0=256 1=2.000000e-05
Convolution              conv_94                  1 1 150 151 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_175                1 1 151 152 0=256
Convolution              conv_95                  1 1 152 153 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_22                   2 1 153 148 154 0=0
Split                    splitncnn_21             1 2 154 155 156
BatchNorm                bn_21                    1 1 156 157 0=256 1=2.000000e-05
Convolution              conv_96                  1 1 157 158 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_176                1 1 158 159 0=256
Convolution              conv_97                  1 1 159 160 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_23                   2 1 160 155 161 0=0
Split                    splitncnn_22             1 2 161 162 163
BatchNorm                bn_22                    1 1 163 164 0=256 1=2.000000e-05
Convolution              conv_98                  1 1 164 165 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_177                1 1 165 166 0=256
Convolution              conv_99                  1 1 166 167 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_24                   2 1 167 162 168 0=0
Split                    splitncnn_23             1 2 168 169 170
BatchNorm                bn_23                    1 1 170 171 0=256 1=2.000000e-05
Convolution              conv_100                 1 1 171 172 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_178                1 1 172 173 0=256
Convolution              conv_101                 1 1 173 174 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_25                   2 1 174 169 175 0=0
Split                    splitncnn_24             1 2 175 176 177
BatchNorm                bn_24                    1 1 177 178 0=256 1=2.000000e-05
Convolution              conv_102                 1 1 178 179 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_179                1 1 179 180 0=256
Convolution              conv_103                 1 1 180 181 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_26                   2 1 181 176 182 0=0
Split                    splitncnn_25             1 2 182 183 184
BatchNorm                bn_25                    1 1 184 185 0=256 1=2.000000e-05
Convolution              conv_104                 1 1 185 186 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_180                1 1 186 187 0=256
Convolution              conv_105                 1 1 187 188 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_27                   2 1 188 183 189 0=0
Split                    splitncnn_26             1 2 189 190 191
BatchNorm                bn_26                    1 1 191 192 0=256 1=2.000000e-05
Convolution              conv_106                 1 1 192 193 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_181                1 1 193 194 0=256
Convolution              conv_107                 1 1 194 195 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_28                   2 1 195 190 196 0=0
Split                    splitncnn_27             1 2 196 197 198
BatchNorm                bn_27                    1 1 198 199 0=256 1=2.000000e-05
Convolution              conv_108                 1 1 199 200 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_182                1 1 200 201 0=256
Convolution              conv_109                 1 1 201 202 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_29                   2 1 202 197 203 0=0
Split                    splitncnn_28             1 2 203 204 205
BatchNorm                bn_28                    1 1 205 206 0=256 1=2.000000e-05
Convolution              conv_110                 1 1 206 207 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_183                1 1 207 208 0=256
Convolution              conv_111                 1 1 208 209 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_30                   2 1 209 204 210 0=0
Split                    splitncnn_29             1 2 210 211 212
BatchNorm                bn_29                    1 1 212 213 0=256 1=2.000000e-05
Convolution              conv_112                 1 1 213 214 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_184                1 1 214 215 0=256
Convolution              conv_113                 1 1 215 216 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_31                   2 1 216 211 217 0=0
Split                    splitncnn_30             1 2 217 218 219
BatchNorm                bn_30                    1 1 219 220 0=256 1=2.000000e-05
Convolution              conv_114                 1 1 220 221 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_185                1 1 221 222 0=256
Convolution              conv_115                 1 1 222 223 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_32                   2 1 223 218 224 0=0
Split                    splitncnn_31             1 2 224 225 226
BatchNorm                bn_31                    1 1 226 227 0=256 1=2.000000e-05
Convolution              conv_116                 1 1 227 228 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_186                1 1 228 229 0=256
Convolution              conv_117                 1 1 229 230 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_33                   2 1 230 225 231 0=0
Split                    splitncnn_32             1 2 231 232 233
BatchNorm                bn_32                    1 1 233 234 0=256 1=2.000000e-05
Convolution              conv_118                 1 1 234 235 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_187                1 1 235 236 0=256
Convolution              conv_119                 1 1 236 237 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_34                   2 1 237 232 238 0=0
Split                    splitncnn_33             1 2 238 239 240
BatchNorm                bn_33                    1 1 240 241 0=256 1=2.000000e-05
Convolution              conv_120                 1 1 241 242 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_188                1 1 242 243 0=256
Convolution              conv_121                 1 1 243 244 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_35                   2 1 244 239 245 0=0
Split                    splitncnn_34             1 2 245 246 247
BatchNorm                bn_34                    1 1 247 248 0=256 1=2.000000e-05
Convolution              conv_122                 1 1 248 249 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_189                1 1 249 250 0=256
Convolution              conv_123                 1 1 250 251 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_36                   2 1 251 246 252 0=0
Split                    splitncnn_35             1 2 252 253 254
BatchNorm                bn_35                    1 1 254 255 0=256 1=2.000000e-05
Convolution              conv_124                 1 1 255 256 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_190                1 1 256 257 0=256
Convolution              conv_125                 1 1 257 258 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_37                   2 1 258 253 259 0=0
Split                    splitncnn_36             1 2 259 260 261
BatchNorm                bn_36                    1 1 261 262 0=256 1=2.000000e-05
Convolution              conv_126                 1 1 262 263 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_191                1 1 263 264 0=256
Convolution              conv_127                 1 1 264 265 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_38                   2 1 265 260 266 0=0
Split                    splitncnn_37             1 2 266 267 268
BatchNorm                bn_37                    1 1 268 269 0=256 1=2.000000e-05
Convolution              conv_128                 1 1 269 270 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_192                1 1 270 271 0=256
Convolution              conv_129                 1 1 271 272 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_39                   2 1 272 267 273 0=0
Split                    splitncnn_38             1 2 273 274 275
BatchNorm                bn_38                    1 1 275 276 0=256 1=2.000000e-05
Convolution              conv_130                 1 1 276 277 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_193                1 1 277 278 0=256
Convolution              conv_131                 1 1 278 279 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_40                   2 1 279 274 280 0=0
Split                    splitncnn_39             1 2 280 281 282
BatchNorm                bn_39                    1 1 282 283 0=256 1=2.000000e-05
Convolution              conv_132                 1 1 283 284 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_194                1 1 284 285 0=256
Convolution              conv_133                 1 1 285 286 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_41                   2 1 286 281 287 0=0
Split                    splitncnn_40             1 2 287 288 289
BatchNorm                bn_40                    1 1 289 290 0=256 1=2.000000e-05
Convolution              conv_134                 1 1 290 291 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_195                1 1 291 292 0=256
Convolution              conv_135                 1 1 292 293 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_42                   2 1 293 288 294 0=0
Split                    splitncnn_41             1 2 294 295 296
BatchNorm                bn_41                    1 1 296 297 0=256 1=2.000000e-05
Convolution              conv_136                 1 1 297 298 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_196                1 1 298 299 0=256
Convolution              conv_137                 1 1 299 300 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_43                   2 1 300 295 301 0=0
Split                    splitncnn_42             1 2 301 302 303
BatchNorm                bn_42                    1 1 303 304 0=256 1=2.000000e-05
Convolution              conv_138                 1 1 304 305 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_197                1 1 305 306 0=256
Convolution              conv_139                 1 1 306 307 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_44                   2 1 307 302 308 0=0
Split                    splitncnn_43             1 2 308 309 310
BatchNorm                bn_43                    1 1 310 311 0=256 1=2.000000e-05
Convolution              conv_140                 1 1 311 312 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_198                1 1 312 313 0=256
Convolution              conv_141                 1 1 313 314 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_45                   2 1 314 309 315 0=0
Split                    splitncnn_44             1 2 315 316 317
BatchNorm                bn_44                    1 1 317 318 0=256 1=2.000000e-05
Convolution              conv_142                 1 1 318 319 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_199                1 1 319 320 0=256
Convolution              conv_143                 1 1 320 321 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_46                   2 1 321 316 322 0=0
Split                    splitncnn_45             1 2 322 323 324
BatchNorm                bn_45                    1 1 324 325 0=256 1=2.000000e-05
Convolution              conv_144                 1 1 325 326 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
PReLU                    prelu_200                1 1 326 327 0=256
Convolution              conv_145                 1 1 327 328 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_47                   2 1 328 323 329 0=0
Split                    splitncnn_46             1 2 329 330 331
BatchNorm                bn_46                    1 1 330 332 0=256 1=2.000000e-05
Convolution              conv_146                 1 1 332 333 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
PReLU                    prelu_201                1 1 333 334 0=512
Convolution              conv_147                 1 1 334 335 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Convolution              conv_148                 1 1 331 336 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_48                   2 1 335 336 337 0=0
Split                    splitncnn_47             1 2 337 338 339
BatchNorm                bn_47                    1 1 339 340 0=512 1=2.000000e-05
Convolution              conv_149                 1 1 340 341 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
PReLU                    prelu_202                1 1 341 342 0=512
Convolution              conv_150                 1 1 342 343 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_49                   2 1 343 338 344 0=0
Split                    splitncnn_48             1 2 344 345 346
BatchNorm                bn_48                    1 1 346 347 0=512 1=2.000000e-05
Convolution              conv_151                 1 1 347 348 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
PReLU                    prelu_203                1 1 348 349 0=512
Convolution              conv_152                 1 1 349 350 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_50                   2 1 350 345 351 0=0
BatchNorm                bn_49                    1 1 351 352 0=512 1=2.000000e-05
Flatten                  flatten_204              1 1 352 353
InnerProduct             linear_153               1 1 353 out0 0=512 1=1 2=12845056
