7767517
99 114
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_1               1 1 2 3 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 3 4 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              convrelu_2               1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 5 6 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              convrelu_3               1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 7 8 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              convrelu_4               1 1 8 9 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 9 10 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_5               1 1 10 11 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 11 12 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_6               1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_0              1 4 13 14 15 16 17
Convolution              conv_7                   1 1 17 18 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convrelu_7               1 1 18 19 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              conv_9                   1 1 19 20 0=16 1=3 11=3 12=2 13=1 14=2 2=2 3=1 4=2 5=1 6=2304
Convolution              conv_10                  1 1 16 21 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convrelu_8               1 1 21 22 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              conv_12                  1 1 22 23 0=16 1=3 11=3 12=3 13=1 14=3 2=3 3=1 4=3 5=1 6=2304
Convolution              conv_13                  1 1 15 24 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convrelu_9               1 1 24 25 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=1
Convolution              convrelu_10              1 1 25 26 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 9=1
Convolution              conv_16                  1 1 26 27 0=16 1=3 11=3 12=5 13=1 14=5 2=5 3=1 4=5 5=1 6=2304
Concat                   cat_0                    3 1 20 23 27 28 0=0
Convolution              conv_17                  1 1 28 29 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_18                  1 1 14 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_0                    2 1 29 30 31 0=0
ReLU                     relu_51                  1 1 31 32
Split                    splitncnn_1              1 3 32 33 34 35
ConvolutionDepthWise     convdwrelu_6             1 1 35 36 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_19                  1 1 36 37 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Permute                  permute_72               1 1 37 38 0=3
Reshape                  reshape_80               1 1 38 39 0=2 1=3600
ConvolutionDepthWise     convdwrelu_7             1 1 34 40 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_20                  1 1 40 41 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Permute                  permute_73               1 1 41 42 0=3
Reshape                  reshape_81               1 1 42 43 0=4 1=3600
ConvolutionDepthWise     convdwrelu_8             1 1 33 44 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_11              1 1 44 45 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 45 46 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_12              1 1 46 47 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 47 48 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_13              1 1 48 49 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_2              1 3 49 50 51 52
ConvolutionDepthWise     convdwrelu_11            1 1 52 53 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              conv_24                  1 1 53 54 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Permute                  permute_74               1 1 54 55 0=3
Reshape                  reshape_82               1 1 55 56 0=2 1=600
ConvolutionDepthWise     convdwrelu_12            1 1 51 57 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              conv_25                  1 1 57 58 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Permute                  permute_75               1 1 58 59 0=3
Reshape                  reshape_83               1 1 59 60 0=4 1=600
ConvolutionDepthWise     convdwrelu_13            1 1 50 61 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_14              1 1 61 62 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
ConvolutionDepthWise     convdwrelu_14            1 1 62 63 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_15              1 1 63 64 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Split                    splitncnn_3              1 3 64 65 66 67
ConvolutionDepthWise     convdwrelu_15            1 1 67 68 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              conv_28                  1 1 68 69 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Permute                  permute_76               1 1 69 70 0=3
Reshape                  reshape_84               1 1 70 71 0=2 1=160
ConvolutionDepthWise     convdwrelu_16            1 1 66 72 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              conv_29                  1 1 72 73 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Permute                  permute_77               1 1 73 74 0=3
Reshape                  reshape_85               1 1 74 75 0=4 1=160
Convolution              convrelu_16              1 1 65 76 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_17            1 1 76 77 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_17              1 1 77 78 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Split                    splitncnn_4              1 2 78 79 80
Convolution              conv_32                  1 1 80 81 0=6 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=13824
Permute                  permute_78               1 1 81 82 0=3
Reshape                  reshape_86               1 1 82 83 0=2 1=60
Convolution              conv_33                  1 1 79 84 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648
Permute                  permute_79               1 1 84 85 0=3
Reshape                  reshape_87               1 1 85 86 0=4 1=60
Concat                   cat_1                    4 1 39 56 71 83 87 0=0
Concat                   cat_2                    4 1 43 60 75 86 88 0=0
Softmax                  softmax_71               1 1 87 out0 0=1 1=1
Slice                    tensor_split_0           1 2 88 90 91 -23300=2,2,-233 1=1
MemoryData               pnnx_465                 0 1 92 0=2 1=4420
Split                    splitncnn_0              1 2 92 93 94
MemoryData               pnnx_467                 0 1 95 0=2 1=4420
BinaryOp                 mul_1                    1 1 90 96 0=2 1=1 2=0.1
BinaryOp                 mul_2                    2 1 96 93 97 0=2
BinaryOp                 add_3                    2 1 97 95 98 0=0
BinaryOp                 mul_4                    1 1 91 99 0=2 1=1 2=0.2
UnaryOp                  exp_5                    1 1 99 100 0=7
BinaryOp                 mul_6                    2 1 100 94 101 0=2
Concat                   cat_3                    2 1 98 101 102 0=1
Slice                    tensor_split_1           1 2 102 103 104 -23300=2,2,-233 1=1
Split                    splitncnn_6              1 2 104 105 106
Split                    splitncnn_5              1 2 103 107 108
BinaryOp                 div_7                    1 1 105 109 0=3 1=1 2=2.0
BinaryOp                 sub_8                    2 1 107 109 110 0=1
BinaryOp                 div_9                    1 1 106 111 0=3 1=1 2=2.0
BinaryOp                 add_10                   2 1 108 111 112 0=0
Concat                   cat_4                    2 1 110 112 out1 0=1
