7767517
97 109
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_1               1 1 2 3 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 3 4 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_2               1 1 4 5 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 5 6 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=360 7=40 9=1
Convolution              convrelu_3               1 1 6 7 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1600 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 7 8 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=360 7=40 9=1
Convolution              convrelu_4               1 1 8 9 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2880 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 9 10 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=648 7=72 9=1
Convolution              convrelu_5               1 1 10 11 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5184 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 11 12 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=648 7=72 9=1
Convolution              convrelu_6               1 1 12 13 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5184 9=1
Split                    splitncnn_0              1 2 13 14 15
ConvolutionDepthWise     convdwrelu_6             1 1 15 16 0=72 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 7=72 9=1
Convolution              convrelu_7               1 1 16 17 0=152 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10944 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 17 18 0=152 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1368 7=152 9=1
Convolution              convrelu_8               1 1 18 19 0=152 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=23104 9=1
Split                    splitncnn_1              1 2 19 20 21
ConvolutionDepthWise     convdwrelu_8             1 1 21 22 0=152 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1368 7=152 9=1
Convolution              convrelu_9               1 1 22 23 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=43776 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 23 24 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution              convrelu_10              1 1 24 25 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 25 26 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution              convrelu_11              1 1 26 27 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise     convdwrelu_11            1 1 27 28 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution              convrelu_12              1 1 28 29 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise     convdwrelu_12            1 1 29 30 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution              convrelu_13              1 1 30 31 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise     convdwrelu_13            1 1 31 32 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution              convrelu_14              1 1 32 33 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
Convolution              conv_15                  1 1 14 34 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Convolution              conv_16                  1 1 20 35 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2432
Convolution              conv_17                  1 1 33 36 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_2              1 2 36 37 38
Interp                   interpolate_40           1 1 38 39 0=1 3=40 4=40 6=0
BinaryOp                 add_0                    2 1 35 39 40 0=0
Split                    splitncnn_3              1 2 40 41 42
Interp                   interpolate_41           1 1 42 43 0=1 3=80 4=80 6=0
BinaryOp                 add_1                    2 1 34 43 44 0=0
Convolution              conv_18                  1 1 44 45 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Split                    splitncnn_4              1 2 45 46 47
Convolution              conv_19                  1 1 41 48 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              conv_20                  1 1 37 49 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              conv_21                  1 1 46 50 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304
BinaryOp                 add_2                    2 1 48 50 51 0=0
Split                    splitncnn_5              1 2 51 52 53
Convolution              conv_22                  1 1 53 54 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304
BinaryOp                 add_3                    2 1 49 54 55 0=0
Convolution              conv_23                  1 1 52 56 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              conv_24                  1 1 55 57 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
ConvolutionDepthWise     convdwrelu_14            1 1 47 58 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_15              1 1 58 59 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_15            1 1 59 60 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_16              1 1 60 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_6              1 3 61 62 63 64
Convolution              conv_27                  1 1 64 65 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Convolution              conv_28                  1 1 63 66 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution              conv_29                  1 1 62 67 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Permute                  permute_86               1 1 65 68 0=3
Reshape                  reshape_95               1 1 68 69 0=1 1=12800
Sigmoid                  sigmoid_83               1 1 69 out0
Permute                  permute_87               1 1 66 71 0=3
Reshape                  reshape_96               1 1 71 out3 0=4 1=12800
Permute                  permute_88               1 1 67 73 0=3
Reshape                  reshape_97               1 1 73 out6 0=10 1=12800
ConvolutionDepthWise     convdwrelu_16            1 1 56 75 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_17              1 1 75 76 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_17            1 1 76 77 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_18              1 1 77 78 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_7              1 3 78 79 80 81
Convolution              conv_32                  1 1 81 82 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Convolution              conv_33                  1 1 80 83 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution              conv_34                  1 1 79 84 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Permute                  permute_89               1 1 82 85 0=3
Reshape                  reshape_98               1 1 85 86 0=1 1=3200
Sigmoid                  sigmoid_84               1 1 86 out1
Permute                  permute_90               1 1 83 88 0=3
Reshape                  reshape_99               1 1 88 out4 0=4 1=3200
Permute                  permute_91               1 1 84 90 0=3
Reshape                  reshape_100              1 1 90 out7 0=10 1=3200
ConvolutionDepthWise     convdwrelu_18            1 1 57 92 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              convrelu_19              1 1 92 93 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_19            1 1 93 94 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              convrelu_20              1 1 94 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_8              1 3 95 96 97 98
Convolution              conv_37                  1 1 98 99 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Convolution              conv_38                  1 1 97 100 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution              conv_39                  1 1 96 101 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Permute                  permute_92               1 1 99 102 0=3
Reshape                  reshape_101              1 1 102 103 0=1 1=800
Sigmoid                  sigmoid_85               1 1 103 out2
Permute                  permute_93               1 1 100 105 0=3
Reshape                  reshape_102              1 1 105 out5 0=4 1=800
Permute                  permute_94               1 1 101 107 0=3
Reshape                  reshape_103              1 1 107 out8 0=10 1=800
